import json
import google.generativeai as genai
from dotenv import load_dotenv
import os

load_dotenv()

def price_comparison(my_data, competitors_data, my_company_name):
    genai.configure(api_key=os.getenv("GEMINI_API_KEY"))

    # Використовуємо доступну модель gemini-1.5-flash або gemini-pro
    model = genai.GenerativeModel(
        model_name="gemini-1.5-flash",
        generation_config={
            "temperature": 0.3,
            "top_p": 1,
            "top_k": 40,
            "max_output_tokens": 999999
        }
    )
    response_text = ""
    prompt = f"""
Ти — професійний аналітик ринку та спеціаліст з продажу автомобільних акумуляторів компанії {my_company_name}.

Завдання:
1. Проаналізуй наші ціни порівняно з цінами конкурентів.
2. Ігноруй акумулятори, для яких немає аналогів у конкурентів (пропускай їх без помилок чи зауважень).
3. Визнач, де ми дорожчі, а де дешевші.(НАЗИВАЙ КОНКРЕТНІ МОДЕЛІ) і в цифрах також у відстоках
4. Поясни можливі причини цінових відмінностей (бренд, ємність, пусковий струм, тип, популярність).
5. Виділи бренди або моделі з потенціалом для маркетингового просування.(назви декілька які вважаєш потрібними) і в цифрах також у відстоках
6. Рекомендовані моделі для зниження ціни або акцій.(НАЗИВАЙ КОНКРЕТНІ МОДЕЛІ)і в цифрах також у відстоках
7. Підсумуй цінову політику: що працює, що потребує змін. і в цифрах також у відстоках

Вхідні дані:
- Наші ціни: {my_data}
- Ціни конкурентів: {competitors_data}

Відповідь:
- Глибокий аналіз без таблиць.
- Акцент на сильні та слабкі сторін.
- Топ-3 моделі для просування і для зниження ціни.
- Висновки та рекомендації.
- Використовуй більше конкретики в плані конкретних акумуляторів
- використовуй емоджі
-!!! Використовуй українську мову паобільше цифр і конкретики

"""
    try:
        response = model.generate_content(prompt)
        response_text = response.text
                
    except Exception as e:          
        return {"error": str(e)}

    return response_text
